1. **Display the names of all people in the airline database**

In [ ]:
SELECT name FROM Passenger

2. **Display the names of all airlines**

In [ ]:
SELECT name FROM Company

3. **Display all flights originating from Moscow**

In [ ]:
SELECT *FROM Trip WHERE town_from = 'Moscow'

4. **Print people's names that end in "man"**

In [ ]:
SELECT name FROM Passenger WHERE name LIKE "%man";

5. **Display the number of flights performed on TU-134**

In [ ]:
SELECT COUNT(*) AS count FROM Trip WHERE plane = "TU-134"

6. **Which companies flew Boeing**

In [ ]:
SELECT DISTINCT name FROM Company INNER JOIN Trip ON Company.id = Trip.company WHERE plane = "Boeing";

7. **Display all the names of planes that can fly to Moscow**

In [ ]:
SELECT DISTINCT plane FROM Trip WHERE town_to = "Moscow";

9. **Which companies organize flights from Vladivostok?**

In [ ]:
SELECT DISTINCT name FROM Company INNER JOIN Trip ON Company.id = Trip.company WHERE town_to = "Vladivostok"

12. **Print the IDs of all flights and the number of passengers on them. Note that some flights may have no passengers. In this case, print the number "0".**

In [ ]:
SELECT Trip.id, COUNT(passenger) AS COUNT FROM Trip LEFT JOIN Pass_in_trip ON Pass_in_trip.trip = Trip.id GROUP BY Trip.id

14. **Which cities did Bruce Willis fly to?**

In [ ]:
SELECT DISTINCT town_to FROM Trip JOIN Pass_in_trip ON Trip.id = Pass_in_trip.trip JOIN Passenger ON Pass_in_trip.passenger = Passenger.id WHERE name = 'Bruce Willis'

15. **Display the passenger ID Steve Martin and the date and time of his arrival in London**

In [ ]:
SELECT Passenger.id, Trip.time_in FROM Passenger INNER JOIN Pass_in_trip ON Passenger.id = Pass_in_trip.passenger INNER JOIN Trip ON Pass_in_trip.trip = Trip.id WHERE Passenger.name = 'Steve Martin' AND Trip.town_to = 'London'

19. **Determine which family member bought the potatoes**

In [ ]:
SELECT DISTINCT FamilyMembers.status FROM FamilyMembers INNER JOIN Payments ON FamilyMembers.member_id = Payments.family_member INNER JOIN Goods ON Payments.good = Goods.good_id WHERE Goods.good_name = 'potato'

22. **Find the names of all mothers**

In [ ]:
SELECT FamilyMembers.member_name FROM FamilyMembers WHERE FamilyMembers.status = 'mother'

28. **How many flights did airlines operate from Rostov to Moscow?**

In [ ]:
SELECT COUNT(*) AS count FROM Trip WHERE Trip.town_from = 'Rostov' AND Trip.town_to = 'Moscow'

34. **How many 10th grades are there in total?**

In [ ]:
SELECT COUNT(*) AS count FROM Class WHERE Class.name LIKE '10%'

36. **Display information about students living on Pushkin Street**

In [ ]:
SELECT *FROM Student WHERE Student.address LIKE 'ul. Pushkina%'

38. **How long has Anna been going to school?**

In [ ]:
SELECT COUNT(*) AS count FROM Student WHERE Student.first_name = 'Anna'

39. **How many students are there in class 10B?**

In [ ]:
SELECT COUNT(*) AS count FROM Student_in_class
JOIN Class ON Class.id=class WHERE name LIKE '10 B';

41. **Find out what time the fourth class is scheduled to start.**

In [ ]:
SELECT Timepair.start_pair FROM Timepair WHERE Timepair.id = '4'

53. **Change the name "Andie Quincey" to the new "Andie Anthony".**

In [ ]:
UPDATE FamilyMembers SET FamilyMembers.member_name = 'Andie Anthony' WHERE FamilyMembers.member_name = 'Andie Quincey'

56. **Delete all flights originating from Moscow.**

In [ ]:
DELETE FROM Trip WHERE Trip.town_from = 'Moscow'

74. **Output the identifier and the sign of the presence of the Internet in the premises. If the Internet is present in the rented accommodation, then output "YES", otherwise "NO".**

In [ ]:
SELECT
    Rooms.id, IF(has_internet = 1, 'YES', 'NO') AS has_internet
FROM Rooms

75. **Display the last name, first name and date of birth of students who were born in May.**

In [ ]:
SELECT Student.last_name, Student.first_name, Student.birthday FROM Student WHERE Student.birthday LIKE '%-05-%'

99. **Calculate the revenue from the female audience (revenue = sum(price * items)). Note that in the table the female audience has a user_gender field "female" or "f".**

In [ ]:
SELECT SUM(price*items) as income_from_female FROM Purchases WHERE Purchases.user_gender = 'female' OR Purchases.user_gender = 'f'

103. **List the names of employees who receive a higher salary than their immediate supervisor.**

In [ ]:
SELECT employee.name FROM Employee AS employee , Employee AS chiefs WHERE chiefs.id = employee.chief_id AND chiefs.salary < employee.salary

109. **Display the name of the country where the city "Salzburg" is located.**

In [ ]:
SELECT Countries.name AS country_name FROM Countries JOIN Regions ON Countries.id = Regions.countryid JOIN Cities ON Regions.id = Cities.regionid WHERE Cities.name = 'Salzburg'

114. **Write a query that will return the names of pilots who flew as a second pilot (second_pilot_id) to New York in August 2023**

In [ ]:
SELECT DISTINCT name FROM Pilots JOIN Flights ON Pilots.pilot_id = Flights.second_pilot_id WHERE Flights.flight_date LIKE '%2023-08%' AND Flights.destination = 'New York'